# Практическая работа 7
# Задание 1: Дана строка. Преобразовать в ней все строчные буквы
# (как латинские, так и русские) в прописные.

stroka = input("Введите строку: ")
result = stroka.upper()
print("Результат:", result)
